{
  "1": {
    "projectTitle": "Christoph Muenks Portfolio",
    "projectText": "A portfolio site for Christoph Muenks to showcase his blacksmithing work. Created using Vue.js and Gridsome. Complete with custom language switcher and very simple CMS style JSON configuration files.",
    "skills": [
      "Vue.js",
      "Gridsome",
      "Sass/CSS"
    ]
  },
  "2": {
    "projectTitle": "VinylHub",
    "projectText": "A web application for managing and tracking vinyl records. Integrated with the world’s largest physical music database. Ability to search via barcode or catalogue number.",
    "skills": [
      "Laravel / Vue.js\n",
      "JavaScript / PHP\n",
      "MySQL / database infrastructure",
      "Discogs API\n integration",
      "Sass/CSS",
      "AWS / S3",
      "Webpack",
      "Chart.js, Quagga.js, Velocity.js\n",
      "Design/branding"
    ],
    "img": "VinylHub_Screens.png"
  },
  "3": {
    "projectTitle": "PicShare",
    "projectText": "A native Android application written in Java, the app allows users to upload images and share them via a unique gallery code or via a URL. Once a gallery has been shared they have the ability to view and download the images.",
    "skills": [
      "Android Studio",
      "Java / Android SDK",
      "Firebase",
      "Picasso"
    ]
  },
  "4": {
    "projectTitle": "Viking Wars",
    "projectText": "A multiplayer turn based viking shooting game.  Players spectate the opponents turn with projectile tracking/camera scrolling. Complete with animated health bars and physics.",
    "skills": [
      "JavaScript",
      "Phaser.io",
      "Websockets (Socket.io)",
      "Webpack"
    ]
  },
  "5": {
    "projectTitle": "Modern House\n",
    "projectText": "A 3D rendered sequence modelled and animated using Blender. Built from scratch using a variety of modelling techniques. Animated camera sequences and dynamic materials using the node editor.",
    "skills": [
      "Blender",
      "Premier Pro"
    ]
  },
  "6": {
    "projectTitle": "Fish Frenzy",
    "projectText": "A single player high score based fish eating game. Built with Phaser.io and JavaScript. Animated sprites, continuously spawning enemies, watch out for those divers and sharks! ",
    "skills": [
      "JavaScript",
      "Phaser.io",
      "Browserify"
    ]
  }
}